package com.goga133.oknaservice.ui.info

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class InfoViewModel : ViewModel() {

    private val _text = MutableLiveData<String>().apply {
        value = "Компания «Окна Сервис» более 15 лет работает на строительном рынке Подмосковья. Одним из главных направлений деятельности компаний стало производство и монтаж пластиковых окон на основе профиля Rehau и рам из алюминиевого профиля на основе профиля Provedal.\n" +
                "\n" +
                "Собственное производство компании расположено в городе Подольске и оснащено современным высокоэффективым оборудованием, что позволяет предлагать жителям столичного региона самые выгодные на рынке цены на всю гамму продукции.\n" +
                "\n" +
                "Мы сами производим стеклопакеты, и это позволяет гарантировать нашим покупателям высокое качество самого ответственного элемента окна. Производятся одно- и двухкамерные стеклопакеты толщиной 24, 32 и 40 мм. В стеклопакетах используется стекло повышенной степени прозрачности M1. По желанию клиента в стеклопакетах могут быть установлены тонированные стекла.\n" +
                "\n" +
                "На производстве поддерживается современная система организации производства в полном соответствии с рекомендациями фирмы REHAU. Большая часть сотрудников работает в компании «Окна Сервис» более 5 лет. У нас принята внутренняя система оценки квалификации сотрудников на основе ежегодной аттестации, поддерживается система стимулирования труда.\n"
    }
    val text: LiveData<String> = _text
}